tutorials/multiphase/cavitatingFoam/les/throttle3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          510;
        startFace       220900;
    }
    outlet
    {
        type            patch;
        nFaces          510;
        startFace       221410;
    }
    walls
    {
        type            wall;
        nFaces          4360;
        startFace       221920;
    }
    frontBack
    {
        type            wall;
        nFaces          15420;
        startFace       226280;
    }
)

// ************************************************************************* //
